<?php

return array (
  'accepted' => ': विशेषता को स्वीकार किया जाना चाहिए।',
  'active_url' => ': विशेषता एक मान्य URL नहीं है।',
  'after' => 'ए: विशेषता के बाद की तारीख होनी चाहिए: तारीख।',
  'after_or_equal' => 'विशेषता: तारीख के बाद या उसके बराबर की तारीख होना चाहिए।',
  'alpha' => ': विशेषता में केवल अक्षर हो सकते हैं।',
  'alpha_dash' => ': विशेषता में केवल अक्षर, संख्याएं, डैश और अंडरस्कोर हो सकते हैं।',
  'alpha_num' => ': विशेषता में केवल अक्षर और संख्याएँ हो सकती हैं।',
  'array' => ': विशेषता एक सरणी होनी चाहिए।',
  'before' => 'विशेषता: तारीख से पहले की तारीख होनी चाहिए।',
  'before_or_equal' => 'विशेषता: तिथि से पहले या उसके बराबर की तारीख होना चाहिए।',
  'between' => 
  array (
    'numeric' => 'ए: विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम।',
    'file' => 'ए: विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम किलोबाइट।',
    'string' => ': विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम वर्ण।',
    'array' => ': गुण के बीच होना चाहिए: न्यूनतम और: अधिकतम आइटम।',
  ),
  'boolean' => ': विशेषता फ़ील्ड सही या गलत होना चाहिए।',
  'confirmed' => ': विशेषता पुष्टि मेल नहीं खाती।',
  'date' => ': विशेषता मान्य दिनांक नहीं है।',
  'date_format' => ': विशेषता प्रारूप से मेल नहीं खाती: प्रारूप।',
  'different' => ': विशेषता और: अन्य अलग होना चाहिए।',
  'digits' => ': गुण होना चाहिए: अंक अंक।',
  'digits_between' => ': विशेषता के बीच होना चाहिए: न्यूनतम और: अधिकतम अंक।',
  'dimensions' => ': विशेषता में अमान्य छवि आयाम हैं।',
  'distinct' => 'विशेषता फ़ील्ड में डुप्लिकेट मान है।',
  'email' => ': विशेषता एक मान्य ईमेल पता होना चाहिए।',
  'exists' => 'चयनित: विशेषता अमान्य है।',
  'file' => ': विशेषता एक फ़ाइल होनी चाहिए।',
  'filled' => 'विशेषता फ़ील्ड का मान होना चाहिए।',
  'gt' => 
  array (
    'numeric' => 'गुण: मान से अधिक होना चाहिए।',
    'file' => 'गुण: मान किलोबाइट से अधिक होना चाहिए।',
    'string' => 'गुण: मान वर्णों से अधिक होना चाहिए।',
    'array' => 'गुण: मान आइटम से अधिक होना चाहिए।',
  ),
  'gte' => 
  array (
    'numeric' => 'गुण: मान से अधिक या बराबर होना चाहिए: मान।',
    'file' => 'ए: विशेषता से अधिक या बराबर होना चाहिए: मूल्य किलोबाइट।',
    'string' => 'गुण: मान वर्ण से अधिक या बराबर होना चाहिए।',
    'array' => 'ए: विशेषता के पास होना चाहिए: मूल्य आइटम या अधिक।',
  ),
  'image' => ': विशेषता एक छवि होनी चाहिए।',
  'in' => 'चयनित: विशेषता अमान्य है।',
  'in_array' => ': विशेषता फ़ील्ड में मौजूद नहीं है: अन्य।',
  'integer' => 'विशेषता: पूर्णांक होना आवश्यक है।',
  'ip' => ': विशेषता एक मान्य IP पता होना चाहिए।',
  'ipv4' => 'विशेषता: एक मान्य IPv4 पता होना चाहिए।',
  'ipv6' => 'विशेषता: एक मान्य IPv6 पता होना चाहिए।',
  'json' => 'विशेषता: एक वैध JSON स्ट्रिंग होना चाहिए।',
  'lt' => 
  array (
    'numeric' => 'गुण: मान से कम होना चाहिए।',
    'file' => 'गुण: मान किलोबाइट से कम होना चाहिए।',
    'string' => 'गुण: मान वर्णों से कम होना चाहिए।',
    'array' => 'गुण: से कम होना चाहिए: मूल्य आइटम।',
  ),
  'lte' => 
  array (
    'numeric' => 'गुण: मान इससे कम या बराबर होना चाहिए: मान।',
    'file' => 'ए: विशेषता से कम या बराबर होना चाहिए: मूल्य किलोबाइट।',
    'string' => 'गुण: मान वर्ण से कम या बराबर होना चाहिए।',
    'array' => ': विशेषता से अधिक नहीं होना चाहिए: मूल्य आइटम।',
  ),
  'max' => 
  array (
    'numeric' => 'विशेषता: अधिकतम से अधिक नहीं हो सकती है।',
    'file' => 'विशेषता: अधिकतम किलोबाइट से अधिक नहीं हो सकती है।',
    'string' => ': विशेषता से अधिक नहीं हो सकता है: अधिकतम वर्ण।',
    'array' => ': विशेषता से अधिक नहीं हो सकता है: अधिकतम आइटम।',
  ),
  'mimes' => ': विशेषता प्रकार की एक फ़ाइल होनी चाहिए: मान।',
  'mimetypes' => ': विशेषता प्रकार की एक फ़ाइल होनी चाहिए: मान।',
  'min' => 
  array (
    'numeric' => 'ए: विशेषता कम से कम होनी चाहिए: न्यूनतम।',
    'file' => 'ए: विशेषता कम से कम होनी चाहिए: न्यूनतम किलोबाइट।',
    'string' => 'ए: विशेषता कम से कम होनी चाहिए: मिन वर्ण।',
    'array' => ': विशेषता में कम से कम: न्यूनतम आइटम होना चाहिए।',
  ),
  'not_in' => 'चयनित: विशेषता अमान्य है।',
  'not_regex' => ': विशेषता स्वरूप अमान्य है।',
  'numeric' => ': विशेषता एक संख्या होनी चाहिए।',
  'present' => ': विशेषता फ़ील्ड मौजूद होना चाहिए।',
  'regex' => ': विशेषता स्वरूप अमान्य है।',
  'required' => ': विशेषता फ़ील्ड आवश्यक है।',
  'required_if' => ': विशेषता फ़ील्ड आवश्यक है जब: अन्य है: मान।',
  'required_unless' => 'जब तक: अन्य: में है: विशेषता फ़ील्ड आवश्यक है।',
  'required_with' => ': मान मौजूद होने पर विशेषता फ़ील्ड आवश्यक है।',
  'required_with_all' => ': मान मौजूद होने पर विशेषता फ़ील्ड आवश्यक है।',
  'required_without' => 'जब मान मौजूद नहीं है: विशेषता फ़ील्ड आवश्यक है।',
  'required_without_all' => 'जब कोई भी मान मौजूद नहीं है: विशेषता फ़ील्ड आवश्यक है।',
  'same' => ': विशेषता और: अन्य मेल खाना चाहिए।',
  'size' => 
  array (
    'numeric' => 'ए: विशेषता होनी चाहिए: आकार।',
    'file' => 'ए: विशेषता होनी चाहिए: आकार किलोबाइट।',
    'string' => ': गुण होना चाहिए: आकार वर्ण।',
    'array' => ': विशेषता में: आइटम होना चाहिए।',
  ),
  'string' => ': विशेषता एक स्ट्रिंग होनी चाहिए।',
  'timezone' => ': विशेषता मान्य क्षेत्र होनी चाहिए।',
  'unique' => 'The: विशेषता को पहले ही लिया जा चुका है।',
  'uploaded' => ': विशेषता अपलोड करने में विफल रही।',
  'url' => ': विशेषता स्वरूप अमान्य है।',
  'custom' => 
  array (
    'attribute-name' => 
    array (
      'rule-name' => 'सीमा शुल्क संदेश',
    ),
  ),
);
