<?php

return array (
  'accepted' => 'ఆ లక్షణాన్ని అంగీకరించాలి.',
  'active_url' => 'ఆ: లక్షణం చెల్లుబాటు అయ్యే URL కాదు.',
  'after' => 'ది: లక్షణం తేదీ తర్వాత ఉండాలి: తేదీ.',
  'after_or_equal' => 'ది: లక్షణం తేదీ తర్వాత లేదా సమానంగా ఉండాలి: తేదీ.',
  'alpha' => 'ది: లక్షణం అక్షరాలు కలిగి ఉండవచ్చు.',
  'alpha_dash' => 'ది: లక్షణం అక్షరాలు, సంఖ్యలు, డాష్లు మరియు అండర్స్కోర్లను మాత్రమే కలిగి ఉండవచ్చు.',
  'alpha_num' => 'ది: లక్షణం అక్షరాలు మరియు సంఖ్యలను మాత్రమే కలిగి ఉండవచ్చు.',
  'array' => 'ది: లక్షణం ఒక అర్రే అయి ఉండాలి.',
  'before' => 'ది: లక్షణం తేదీ ముందు తప్పక ఉండాలి: తేదీ.',
  'before_or_equal' => 'తేదీ: తేదీ ముందు లేదా సమానంగా తేదీ ఉండాలి: తేదీ.',
  'between' => 
  array (
    'numeric' => 'ది: లక్షణం మధ్య ఉండాలి: min మరియు: max.',
    'file' => 'ది: లక్షణం మధ్య ఉండాలి: min మరియు: max kilobytes.',
    'string' => 'ది: లక్షణం మధ్య ఉండాలి: min మరియు: max characters.',
    'array' => 'ది: లక్షణం మధ్య ఉండాలి: min మరియు: max అంశాలను.',
  ),
  'boolean' => 'ఆ: లక్షణం ఫీల్డ్ నిజమైన లేదా తప్పుడు ఉండాలి.',
  'confirmed' => 'ది: గుణం నిర్ధారణ సరిపోలడం లేదు.',
  'date' => 'ఆ: లక్షణం చెల్లుబాటు అయ్యే తేదీ కాదు.',
  'date_format' => 'ఫార్మాట్: లక్షణం ఫార్మాట్ సరిపోలడం లేదు.',
  'different' => 'ది: లక్షణం మరియు: ఇతర భిన్నంగా ఉండాలి.',
  'digits' => 'లక్షణం: అంకెలు అంకెలు ఉండాలి.',
  'digits_between' => 'ది: లక్షణం మధ్య ఉండాలి: min మరియు: max అంకెలు.',
  'dimensions' => ': లక్షణం చెల్లని ఇమేజ్ పరిమాణాలను కలిగి ఉంది.',
  'distinct' => ': గుణం ఫీల్డ్ నకిలీ విలువను కలిగి ఉంది.',
  'email' => 'ఆ: లక్షణం చెల్లుబాటు అయ్యే ఇమెయిల్ చిరునామా అయి ఉండాలి.',
  'exists' => 'ఎంచుకున్నది: లక్షణం చెల్లనిది.',
  'file' => 'ఆ లక్షణం తప్పనిసరిగా ఒక ఫైల్ అయి ఉండాలి.',
  'filled' => 'ఆ: లక్షణం రంగంలో విలువ ఉండాలి.',
  'gt' => 
  array (
    'numeric' => 'ఆ: లక్షణం కంటే ఎక్కువ ఉండాలి: విలువ.',
    'file' => 'విలువ: కిలోబైట్ల విలువ కంటే ఎక్కువ ఉండాలి.',
    'string' => 'విలువ: అక్షరాల కంటే ఎక్కువగా ఉండాలి.',
    'array' => 'విలువ: కంటే ఎక్కువ విలువ ఉండాలి.',
  ),
  'gte' => 
  array (
    'numeric' => 'విలువ: లక్షణం కంటే ఎక్కువ లేదా సమానంగా ఉండాలి: విలువ.',
    'file' => 'విలువ: కిలోబైట్ల విలువ కంటే ఎక్కువ లేదా సమానంగా ఉండాలి.',
    'string' => 'విలువ: విలువలు ఎక్కువ లేదా సమానంగా ఉండాలి: విలువ అక్షరాలు.',
    'array' => 'లక్షణం కలిగి ఉండాలి: విలువ అంశాలు లేదా ఎక్కువ.',
  ),
  'image' => 'ది: లక్షణం తప్పనిసరిగా ఒక చిత్రం అయి ఉండాలి.',
  'in' => 'ఎంచుకున్నది: లక్షణం చెల్లనిది.',
  'in_array' => 'ది: లక్షణం రంగంలో లేదు: ఇతర.',
  'integer' => 'ది: లక్షణం పూర్ణాంకంగా ఉండాలి.',
  'ip' => 'ది: లక్షణం చెల్లుబాటు అయ్యే IP చిరునామా అయి ఉండాలి.',
  'ipv4' => 'ది: లక్షణం చెల్లుబాటు అయ్యే IPv4 చిరునామా అయి ఉండాలి.',
  'ipv6' => 'ది: లక్షణం చెల్లుబాటు అయ్యే IPv6 చిరునామా అయి ఉండాలి.',
  'json' => ': లక్షణం తప్పనిసరిగా చెల్లుబాటు అయ్యే JSON స్ట్రింగ్ అయి ఉండాలి.',
  'lt' => 
  array (
    'numeric' => 'విలువ: విలువ కంటే తక్కువగా ఉండాలి.',
    'file' => 'విలువ: కిలోబైట్ల కంటే తక్కువగా ఉండాలి.',
    'string' => 'విలువ: అక్షరాల కంటే తక్కువగా ఉండాలి.',
    'array' => 'విలువ: విలువ కంటే తక్కువగా ఉండాలి.',
  ),
  'lte' => 
  array (
    'numeric' => 'విలువ: విలువ తప్పక లేదా సమానంగా ఉండాలి: విలువ.',
    'file' => 'విలువ: కిలోబైట్ల కంటే తక్కువ లేదా సమానంగా ఉండాలి.',
    'string' => 'విలువ: అక్షరాల కంటే తక్కువగా లేదా సమానంగా ఉండాలి: విలువ అక్షరాలు.',
    'array' => 'విలువ: విలువలు కంటే ఎక్కువ ఉండకూడదు.',
  ),
  'max' => 
  array (
    'numeric' => 'ఆ: లక్షణం కంటే ఎక్కువ కాదు: గరిష్టంగా.',
    'file' => 'ఆ: లక్షణం కంటే ఎక్కువ కాదు: గరిష్ట కిలోబైట్లు.',
    'string' => 'ఆ: గుణం కంటే ఎక్కువ కాదు: గరిష్ట అక్షరాలు.',
    'array' => ': లక్షణం కంటే ఎక్కువ ఉండకపోవచ్చు: గరిష్ట అంశాలు.',
  ),
  'mimes' => ': లక్షణం రకం యొక్క ఒక ఫైల్ తప్పనిసరిగా:: విలువలు.',
  'mimetypes' => ': లక్షణం రకం యొక్క ఒక ఫైల్ తప్పనిసరిగా:: విలువలు.',
  'min' => 
  array (
    'numeric' => 'ది: లక్షణం కనీసం ఉండాలి: min.',
    'file' => 'ది: లక్షణం కనీసం ఉండాలి: min kilobytes.',
    'string' => 'ది: లక్షణం తప్పనిసరిగా కనీసం ఉండాలి: కనిష్ట అక్షరాలు.',
    'array' => 'ది: లక్షణం కనీసం ఉండాలి: min అంశాలు.',
  ),
  'not_in' => 'ఎంచుకున్నది: లక్షణం చెల్లనిది.',
  'not_regex' => ': గుణం ఫార్మాట్ చెల్లనిది.',
  'numeric' => 'ది: లక్షణం ఒక సంఖ్యగా ఉండాలి.',
  'present' => 'ది: గుణం ఫీల్డ్ ఉండాలి.',
  'regex' => ': గుణం ఫార్మాట్ చెల్లనిది.',
  'required' => 'ది: గుణం ఫీల్డ్ అవసరం.',
  'required_if' => 'ఆ: లక్షణం ఫీల్డ్ అవసరం: ఇతరమైనది: విలువ.',
  'required_unless' => 'ది: గుణం ఫీల్డ్ అవసరం తప్ప: మరొకది: విలువలు.',
  'required_with' => ': లక్షణం ఫీల్డ్ అవసరం: విలువలు ఉంది.',
  'required_with_all' => ': లక్షణం ఫీల్డ్ అవసరం: విలువలు ఉంది.',
  'required_without' => ': లక్షణం ఫీల్డ్ అవసరం: విలువలు లేవు.',
  'required_without_all' => ': ఎవరిలో అయినా విలువలు ఉన్నట్లయితే గుణం ఫీల్డ్ అవసరం.',
  'same' => 'ది: లక్షణం మరియు: ఇతర తప్పక సరిపోవాలి.',
  'size' => 
  array (
    'numeric' => 'ఆ గుణం: పరిమాణం ఉండాలి.',
    'file' => 'ది: లక్షణం తప్పక: పరిమాణం కిలోబైట్లు.',
    'string' => 'లక్షణం: పరిమాణ అక్షరాలు ఉండాలి.',
    'array' => 'ది: లక్షణం కలిగి ఉండాలి: పరిమాణం అంశాలు.',
  ),
  'string' => 'ది: లక్షణం ఒక స్ట్రింగ్ అయి ఉండాలి.',
  'timezone' => 'ఆ: లక్షణం చెల్లుబాటు అయ్యే జోన్గా ఉండాలి.',
  'unique' => 'ఆ లక్షణం ఇప్పటికే తీసుకోబడింది.',
  'uploaded' => ': లక్షణం అప్లోడ్ విఫలమైంది.',
  'url' => ': గుణం ఫార్మాట్ చెల్లనిది.',
  'custom' => 
  array (
    'attribute-name' => 
    array (
      'rule-name' => 'కస్టమ్ సందేశాన్ని',
    ),
  ),
);
